# Deliverable 1: Number of Retiring Employees by Title

#### 1) Create a table containing the number of employees who are about to retire (those born 1952-1955), grouped by job title
##### Create three new tables:
    1) showing number of [titles] retiring
    2) showing number of employees with each title 
    3) showing a list of current employees born between Jan. 1, 1952 and Dec. 31, 1955.

Schema goes here
```sql
SELECT e.emp_no,
	e.first_name,
	e.last_name,
	ti.title,
	ti.from_date,
	s.salary
INTO employee_title
FROM employees as e
INNER JOIN salaries as s
ON (e.emp_no = s.emp_no)
INNER JOIN titles as ti
ON (e.emp_no = ti.emp_no)
WHERE (e.birth_date BETWEEN '1952-01-01' AND '1955-12-31');

SELECT * FROM employee_title;
```

#### 2) Query the new table using the SELECT statement | Your table will contain the following information:

Employee number, First and last name, Title, from_date, Salary

Schema goes here
```sql
SELECT e.emp_no,
	e.first_name,
	e.last_name,
	ti.title,
	ti.from_date,
	ti.to_date,
	s.salary
INTO employee_title
FROM employees as e
INNER JOIN salaries as s
ON (e.emp_no = s.emp_no)
INNER JOIN titles as ti
ON (e.emp_no = ti.emp_no)
WHERE (e.birth_date BETWEEN '1952-01-01' AND '1955-12-31');

SELECT * FROM employee_title;
```

#### 3) Create a new table that includes only the most recent title of each employee. (Exclude the duplicates)
Need to use partitioning and below code to create the table
```sql 
-- Partition the data to show only most recent title per employee
SELECT ______,
 __________,
 _________,
 _______,
 _____
INTO nameyourtable
FROM
 (SELECT ______,
 __________,
 _________,
 _______,
 _____, ROW_NUMBER() OVER
 (PARTITION BY (emp_no)
 ORDER BY to_date DESC) rn
 FROM __________
 ) tmp WHERE rn = 1
ORDER BY emp_no;
```

Schema goes here
```sql
-- Partition the data to show only most recent title per employee
SELECT emp_no,
	first_name,
	last_name,
	title,
	to_date,
	salary
INTO new_retire
FROM
 (SELECT emp_no,
	first_name,
	last_name,
	title,
  	to_date,
	salary, ROW_NUMBER() OVER
 (PARTITION BY (emp_no)
 ORDER BY to_date DESC) rn
 FROM employee_title
 ) tmp WHERE rn = 1
ORDER BY emp_no;

SELECT * FROM new_retire;
```

#### 4) Export the table as csv 
Retirement-ready employees grouped by title

# Deliverable 2: Mentorship Eligibility

#### 1) Create a table that includes the following:
Employee number, First name, Last name, Title, from_date, and to_date
#### Employees will need to have a date of birth that falls between January 1, 1965 and December 31, 1965. 
Hint: Use two inner joins to create this new table

Schema goes here
```sql
SELECT e.emp_no,
	e.first_name,
	e.last_name,
	de.dept_no,
	ti.title,
	de.from_date,
	de.to_date
INTO mentor
FROM employees as e
INNER JOIN dept_emp as de
ON (e.emp_no = de.emp_no)
INNER JOIN titles as ti
ON (e.emp_no = ti.emp_no)
WHERE (de.to_date = '9999-01-01') AND (e.birth_date BETWEEN '1965-01-01' AND '1965-12-31')
ORDER BY emp_no;

SELECT * FROM mentor;
SELECT COUNT (DISTINCT emp_no) FROM mentor;
```

#### 2) Export the table as csv
Employees who are eligible to act as a mentor within the company